import 'package:flutter_job/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: 'Старый Орхей',
    lat: 47.1805,
    lot: 28.5821,
    url:
        'https://img.itinari.com/page/content/original/fcf47528-0633-4822-b02e-263e108bc732-istock-1066139262.jpg?ch=DPR&dpr=2.625&w=994&s=4489d2c075ffeeade1689f4f4fde513c',
    details:
        'Историко-археологический комплекс, расположенный в 60 км к северо-востоку от Кишинёва, на реке Реут, входит в состав природно-культурного заповедника «Старый Орхей», общей площадью около 500 га. В Старом Орхее были найдены следы разных цивилизаций. Здесь располагалась гето-дакская крепость, городище Золотой Орды Янги-Шехр или как его называли арабские путешественники - Шехр аль-Джедид, православные монастыри и молдавский город Орхей.',
    type: 'Историческое место для прогулок',
  ),
  Sight(
    name: 'Замок Мими',
    lat: 46.5330,
    lot: 29.1731,
    url:
        'https://www.castelmimi.md/wp-content/uploads/2020/04/2_Top-Moldovan-winery-with-tours-hotel-restaurant-and-event-venues-scaled.jpg',
    details:
        'Винодельня семьи Мими (после реконструкции также называлась просто Castel Mimi) — винодельня и памятник архитектуры , которая была построена в конце 19 века в село Бульбоака в районе Анений Ной в Молдове.',
    type: 'Замок',
  ),
  Sight(
    name: 'Монастырь Сахарна',
    lat: 47.4144,
    lot: 28.5814,
    url:
    'https://static.tildacdn.com/tild6236-3665-4262-a130-353530643932/_3.jpghttps://static.tildacdn.com/tild6236-3665-4262-a130-353530643932/_3.jpg',
    details:
    'Монастырский комплекс Сахарна назван по наименованию села в окрестностях. Он расположен в окружении живописной природы — в ущелье реки. Вокруг высятся зеленые холмы и древние скалы, в долине журчат родники, а речка Сахарна бурно течет, образуя каскады. Самый высокий водопад местности имеет высоту 10 метров, водные струи падают с обрыва в небольшой природный бассейн, названный «яма цыгана».',
    type: 'Монастырь',
  ),
];
